In [1]:
from ravenclaw.time import construct_timeseries

In [2]:
from pandas import DataFrame

In [6]:
data = DataFrame({'x': [1,2,3,4,5,6,7], 'y': [11,12,13,14,15,16,17], 'g':[1,1,1,1,2,2,2]})

In [7]:
data

   g  x   y
0  1  1  11
1  1  2  12
2  1  3  13
3  1  4  14
4  2  5  15
5  2  6  16
6  2  7  17

In [30]:
construct_timeseries(data=data, amounts=[('number',[1,2,4])], time_col='x', group_by=['g'])

original shape: (7, 3)
result shape: (7, 6)

   g  x   y  y_1number_earlier  y_2numbers_earlier  y_4numbers_earlier
0  1  1  11                NaN                 NaN                 NaN
1  1  2  12               11.0                 NaN                 NaN
2  1  3  13               12.0                11.0                 NaN
3  1  4  14               13.0                12.0                 NaN
4  2  5  15                NaN                 NaN                 NaN
5  2  6  16               15.0                 NaN                 NaN
6  2  7  17               16.0                15.0                 NaN

In [26]:
data=data
amounts=('number',[1,3,4])
time_col=data[['x']]
group_by=data[['g', 'y']]

In [28]:
amounts

('number', [1, 3, 4])

In [27]:
for unit_plus, numbers in amounts:
    print(unit_plus)

ValueError: too many values to unpack (expected 2)

In [22]:
result = data.copy()
merge_on_cols = group_by.copy()
merge_on_cols

   g   y
0  1  11
1  1  12
2  1  13
3  1  14
4  2  15
5  2  16
6  2  17

In [23]:
merge_on_cols.append(time_col)

     g    x     y
0  1.0  NaN  11.0
1  1.0  NaN  12.0
2  1.0  NaN  13.0
3  1.0  NaN  14.0
4  2.0  NaN  15.0
5  2.0  NaN  16.0
6  2.0  NaN  17.0
0  NaN  1.0   NaN
1  NaN  2.0   NaN
2  NaN  3.0   NaN
3  NaN  4.0   NaN
4  NaN  5.0   NaN
5  NaN  6.0   NaN
6  NaN  7.0   NaN

In [16]:
time_col

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: x, dtype: int64